gigaj0ule/fadecandy_bootloader_mk20dx256/mk20dx128.c_bu2.c
    SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIV1(1) | SIM_CLKDIV1_OUTDIV2(1) |  SIM_CLKDIV1_OUTDIV4(3);

    // switch to PLL as clock source, FLL input = 16 MHz / 512
    MCG_C1 = MCG_C1_CLKS(0) | MCG_C1_FRDIV(4);
    // wait for PLL clock to be used
    while ((MCG_S & MCG_S_CLKST_MASK) != MCG_S_CLKST(3)) ;
    // now we're in PEE mode
    // configure USB for 48 MHz clock
    SIM_CLKDIV2 = SIM_CLKDIV2_USBDIV(1); // USB = 96 MHz PLL / 2
    // USB uses PLL clock, trace is CPU clock, CLKOUT=OSCERCLK0
    SIM_SOPT2 = SIM_SOPT2_USBSRC | SIM_SOPT2_PLLFLLSEL | SIM_SOPT2_TRACECLKSEL | SIM_SOPT2_CLKOUTSEL(6);


// #if F_CPU > 16000000
// 	// switch to PLL as clock source, FLL input = 16 MHz / 512
// 	MCG_C1 = MCG_C1_CLKS(0) | MCG_C1_FRDIV(4);
// 	// wait for PLL clock to be used
// 	while ((MCG_S & MCG_S_CLKST_MASK) != MCG_S_CLKST(3)) ;
// 	// now we're in PEE mode
// 	// USB uses PLL clock, trace is CPU clock, CLKOUT=OSCERCLK0
// 	#if defined(KINETISK)
// 	#if F_CPU == 216000000 || F_CPU == 180000000
// 	SIM_SOPT2 = SIM_SOPT2_USBSRC | SIM_SOPT2_IRC48SEL | SIM_SOPT2_TRACECLKSEL | SIM_SOPT2_CLKOUTSEL(6);
// 	#else
// 	SIM_SOPT2 = SIM_SOPT2_USBSRC | SIM_SOPT2_PLLFLLSEL | SIM_SOPT2_TRACECLKSEL | SIM_SOPT2_CLKOUTSEL(6);
// 	#endif
// 	#elif defined(KINETISL)
// 	SIM_SOPT2 = SIM_SOPT2_USBSRC | SIM_SOPT2_PLLFLLSEL | SIM_SOPT2_CLKOUTSEL(6)
// 		| SIM_SOPT2_UART0SRC(1) | SIM_SOPT2_TPMSRC(1);
// 	#endif
// #else
    
// #if F_CPU == 2000000
// 	SIM_SOPT2 = SIM_SOPT2_TRACECLKSEL | SIM_SOPT2_CLKOUTSEL(4) | SIM_SOPT2_UART0SRC(3);
// #else
//     SIM_SOPT2 = SIM_SOPT2_TRACECLKSEL | SIM_SOPT2_CLKOUTSEL(6) | SIM_SOPT2_UART0SRC(2);
// #endif
//     
// #endif

// #if F_CPU <= 2000000
//     // since we are not going into "stop mode" i removed it
// 	SMC_PMCTRL = SMC_PMCTRL_RUNM(2); // VLPR mode :-)
// #endif

	// initialize the SysTick counter
//	SYST_RVR = (F_CPU / 1000) - 1;
//	SYST_CVR = 0;
//	SYST_CSR = SYST_CSR_CLKSOURCE | SYST_CSR_TICKINT | SYST_CSR_ENABLE;
//	SCB_SHPR3 = 0x20200000;  // Systick = priority 32

	//init_pins();
	__enable_irq();

//	_init_Teensyduino_internal_();

//#if defined(KINETISK)
//	// RTC initialization
//	if (RTC_SR & RTC_SR_TIF) {
//		// this code will normally run on a power-up reset
//		// when VBAT has detected a power-up.  Normally our
//		// compiled-in time will be stale.  Write a special
//		// flag into the VBAT register file indicating the
//		// RTC is set with known-stale time and should be
//		// updated when fresh time is known.
//		#if ARDUINO >= 10600
//		rtc_set((uint32_t)&__rtc_localtime);
//		#else
//		rtc_set(TIME_T);
//		#endif
//		*(uint32_t *)0x4003E01C = 0x5A94C3A5;
//	}
//	if ((RCM_SRS0 & RCM_SRS0_PIN) && (*(uint32_t *)0x4003E01C == 0x5A94C3A5)) {
//		// this code should run immediately after an upload
//		// where the Teensy Loader causes the Mini54 to reset.
//		// Our compiled-in time will be very fresh, so set
//		// the RTC with this, and clear the VBAT resister file
//		// data so we don't mess with the time after it's been
//		// set well.
//		#if ARDUINO >= 10600
//		rtc_set((uint32_t)&__rtc_localtime);
//		#else
//		rtc_set(TIME_T);
//		#endif
//		*(uint32_t *)0x4003E01C = 0;
//	}
//#endif

//	__libc_init_array();

//	startup_late_hook();
	main();
	//while (1) ;
}

char *__brkval = (char *)&_ebss;

// #ifndef STACK_MARGIN
// #if defined(__MKL26Z64__)
// #define STACK_MARGIN  512
// #elif defined(__MK20DX128__)
// #define STACK_MARGIN  1024
// #elif defined(__MK20DX256__)
// #define STACK_MARGIN  4096
// #elif defined(__MK64FX512__) || defined(__MK66FX1M0__)
// #define STACK_MARGIN  8192
// #endif
// #endif
// 
// #pragma GCC diagnostic push
// #pragma GCC diagnostic ignored "-Wunused-parameter"










void * _sbrk(int incr)
{
	char *prev, *stack;

	prev = __brkval;
// 	if (incr != 0) {
// 		__asm__ volatile("mov %0, sp" : "=r" (stack) ::);
// 		if (prev + incr >= stack - STACK_MARGIN) {
// 			errno = ENOMEM;
// 			return (void *)-1;
// 		}
// 		__brkval = prev + incr;
// 	}
	return prev;
}

__attribute__((weak)) 
int _read(int file, char *ptr, int len)
{
	return 0;
}

__attribute__((weak)) 
int _close(int fd)
{
	return -1;
}

#include <sys/stat.h>

__attribute__((weak)) 
int _fstat(int fd, struct stat *st)
{
	st->st_mode = S_IFCHR;
	return 0;
}

__attribute__((weak)) 
int _isatty(int fd)
{
	return 1;
}

__attribute__((weak)) 
int _lseek(int fd, long long offset, int whence)
{
	return -1;
}

__attribute__((weak)) 
void _exit(int status)
{
	while (1);
}

__attribute__((weak)) 
void __cxa_pure_virtual()
{
	while (1);
}

__attribute__((weak)) 
int __cxa_guard_acquire (char *g) 
{
	return !(*g);
}

__attribute__((weak)) 
void __cxa_guard_release(char *g)
{
	*g = 1;
}

// __attribute__((weak))
// void abort(void)
// {
// 	while (1) ;
// }

//#pragma GCC diagnostic pop


int nvic_execution_priority(void)
{
	uint32_t priority=256;
	uint32_t primask, faultmask, basepri, ipsr;

	// full algorithm in ARM DDI0403D, page B1-639
	// this isn't quite complete, but hopefully good enough
	__asm__ volatile("mrs %0, faultmask\n" : "=r" (faultmask)::);
	if (faultmask) return -1;
	__asm__ volatile("mrs %0, primask\n" : "=r" (primask)::);
	if (primask) return 0;
	__asm__ volatile("mrs %0, ipsr\n" : "=r" (ipsr)::);
	if (ipsr) {
		if (ipsr < 16) priority = 0; // could be non-zero
		else priority = NVIC_GET_PRIORITY(ipsr - 16);
	}
	__asm__ volatile("mrs %0, basepri\n" : "=r" (basepri)::);
	if (basepri > 0 && basepri < priority) priority = basepri;
	return priority;
}


#if defined(HAS_KINETIS_HSRUN) && F_CPU > 120000000
int kinetis_hsrun_disable(void)
{
	if (SMC_PMSTAT == SMC_PMSTAT_HSRUN) {
		// First, reduce the CPU clock speed, but do not change
		// the peripheral speed (F_BUS).  Serial1 & Serial2 baud
		// rates will be impacted, but most other peripherals
		// will continue functioning at the same speed.
		#if F_CPU == 240000000 && F_BUS == 60000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 3, 1, 7); // ok
		#elif F_CPU == 240000000 && F_BUS == 80000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(2, 2, 2, 8); // ok
		#elif F_CPU == 240000000 && F_BUS == 120000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 1, 1, 7); // ok
		#elif F_CPU == 216000000 && F_BUS == 54000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 3, 1, 7); // ok
		#elif F_CPU == 216000000 && F_BUS == 72000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(2, 2, 2, 8); // ok
		#elif F_CPU == 216000000 && F_BUS == 108000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 1, 1, 7); // ok
		#elif F_CPU == 192000000 && F_BUS == 48000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 3, 1, 7); // ok
		#elif F_CPU == 192000000 && F_BUS == 64000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(2, 2, 2, 8); // ok
		#elif F_CPU == 192000000 && F_BUS == 96000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 1, 1, 7); // ok
		#elif F_CPU == 180000000 && F_BUS == 60000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(2, 2, 2, 8); // ok
		#elif F_CPU == 180000000 && F_BUS == 90000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 1, 1, 7); // ok
		#elif F_CPU == 168000000 && F_BUS == 56000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(2, 2, 2, 5); // ok
		#elif F_CPU == 144000000 && F_BUS == 48000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(2, 2, 2, 5); // ok
		#elif F_CPU == 144000000 && F_BUS == 72000000
			SIM_CLKDIV1 = SIM_CLKDIV1_OUTDIVS(1, 1, 1, 5); // ok
		#else
			return 0;
		#endif
		// Then turn off HSRUN mode
		SMC_PMCTRL = SMC_PMCTRL_RUNM(0);
		while (SMC_PMSTAT == SMC_PMSTAT_HSRUN) ; // wait
		return 1;
	}
	return 0;
}

